<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of ClipMenu.</string>
    <key>Identifier</key>
    <string>com.github.arubdesu.download.ClipMenu</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ClipMenu</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://feeds.feedburner.com/clipmenu-appcast</string>
	</dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is no longer maintained</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
