<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Set ARCHITECTURE to "-arm64" to download for Apple Silicon. Set empty for Intel.</string>
    <key>Description</key>
    <string>Downloads the latest arm64 version of 8x8 Work</string>
    <key>Identifier</key>
    <string>com.github.arubdesu.download.8x8Work</string>
    <key>Input</key>
    <dict>
        <key>ARCHITECTURE</key>
        <string>-arm64</string>
        <key>NAME</key>
        <string>8x8Work</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://support-portal.8x8.com/docrenderservice/services/rest/documents/8bff4970-6fbf-4daf-842d-8ae9b533153d?mandatorKey=MANDATOR_USU&amp;contentLanguage=en&amp;additionalData=references=true&amp;additionalData=referencedDocs=true&amp;additionalData=withGraph=true&amp;additionalData=includeReferencesUpToLevel=all</string>
                <key>re_pattern</key>
                <string>href=\\\"(https://work-desktop-assets\.8x8\.com/prod-publish/tests/work%ARCHITECTURE%-dmg-v8.*?\.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/8x8 Work.app</string>
                <key>requirement</key>
                <string>identifier "com.electron.8x8---virtual-office" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FC967L3QRG</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/8x8 Work.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
