<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download and install the latest Microsoft Office 2016
SKU-less installer package.

Set the REGION key to:

525133 for Americas (default)
532572 for Europe
532577 for Asia</string>
    <key>Identifier</key>
    <string>com.github.autopkg.arubdesu-recipes.install.Office2016Suite</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Office2016Suite</string>
        <key>REGION</key>
        <string>525133</string>
        <key>DOWNLOAD_URL_BASE</key>
        <string>https://go.microsoft.com/fwlink/?linkid=</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.arubdesu-recipes.download.Office2016Suite</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
