<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Finds latest MAU installer, downloads the pkg. Set CULTURE_CODE to a different 
value to get a different localization. See http://msdn.microsoft.com/en-us/library/ee825488(v=cs.20).aspx 
for a table of Culture Codes.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.arubdesu-recipes.munki.Office2016Suite</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.arubdesu-recipes.download.Office2016Suite</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Office2016Suite</string>
        <key>REGION</key>
        <string>525133</string>        
        <key>DOWNLOAD_URL_BASE</key>
        <string>http://go.microsoft.com/fwlink/?linkid=</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Office2011</string>
        <key>CULTURE_CODE</key>
        <string>0409</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                    <string>Microsoft Autoupdate</string>
                    <string>Microsoft Outlook</string>
                    <string>Microsoft Excel</string>
                    <string>Microsoft PowerPoint</string>
                    <string>Microsoft Word</string>
                    <string>Microsoft OneNote</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
