<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Finds latest Microsoft AutoUpdate (MAU) installer, downloads the pkg. Set CULTURE_CODE to a different 
value to get a different localization. See http://msdn.microsoft.com/en-us/library/ee825488(v=cs.20).aspx 
for a table of Culture Codes.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.arubdesu.munki.MAU</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MAU</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Office2011</string>
        <key>CULTURE_CODE</key>
        <string>0409</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
              <string>Microsoft Autoupdate</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MAUURLandUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>culture_code</key>
                <string>%CULTURE_CODE%</string>
                <key>munki_update_name</key>
                <string>%NAME%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Merge input pkginfo and additional_pkginfo generated by MAUURLandUpdateInfoProvider</string>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
