<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current stable version of Synergy</string>
	<key>Identifier</key>
	<string>com.github.autopkg.arubdesu-recipes.download.synergy</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Synergy</string>
		<key>OS_VERSION</key>
		<string>11</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/symless/synergy/releases</string>
				<key>re_pattern</key>
				<string>href="/symless/synergy/releases/tag/v([\d\.]+)-stable</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://symless.com/nightly</string>
				<!-- synergy-v1.8.6-stable-2ab21aa-MacOSX-x86_64.dmg -->
				<key>re_pattern</key>
				<string>href=&quot;(files\/nightly\/synergy-v%version%-stable-[0-9a-f]+-MacOSX-x86_64\.dmg)&quot;</string>
				<key>result_output_var_name</key>
				<string>path</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://symless.com/%path%</string>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>requirement</key>
				<string>identifier synergy and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4HX897Y6GJ"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
