<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Synergy and imports it into a Munki repo.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.arubdesu-recipes.munki.synergy</string>
	<key>version</key>
	<string>%VERSION%</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Synergy</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Synergy combines your desktop devices together in to one cohesive experience. It's software for sharing your mouse and keyboard between multiple computers on your desk. It works on Windows, Mac OS X and Linux.</string>
			<key>display_name</key>
			<string>Synergy</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>maximum_os_version</key>
                        <string>10.%OS_VERSION%.99</string>
                        <key>minimum_os_version</key>
                        <string>10.%OS_VERSION%.0</string>
                        <key>mode</key>
                        <string>a+rX</string>
                        <key>postinstall_script</key>
                        <string>#!/bin/sh
# Uncomment the next line to allow assistive access
# sqlite3 /Library/Application\ Support/com.apple.TCC/TCC.db "INSERT or REPLACE INTO access values ('kTCCServiceAccessibility', 'synergy', 0, 1, 0, NULL);"
			</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.arubdesu-recipes.download.synergy</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%VERSION%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
