<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current stable version of Synergy.

Valid values for ARCH include:
- "x64" (default, Intel)
- "arm64" (Apple Silicon)
</string>
	<key>Identifier</key>
	<string>com.github.autopkg.arubdesu-recipes.download.synergy</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Synergy</string>
		<key>ARCH</key>
		<string>x64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://symless.com/synergy/download</string>
				<key>re_pattern</key>
				<string>\bsynergy-([\d\.]+)-macos-%ARCH%\.dmg\b</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://symless.com/synergy/synergy/api/download/synergy-%version%-macos-%ARCH%.dmg</string>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Synergy.app</string>
				<key>requirement</key>
				<string>identifier "com.symless.synergy" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4HX897Y6GJ"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
