<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest darwin version of aws-vault.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.arubdesu-recipes.aws-vault.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>aws-vault</string>
		<key>arch</key>
		<string>arm64</string>
		<key>Comment</key>
		<string>set to amd64 for intel</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>99designs/aws-vault</string>
                <key>asset_regex</key>
                <string>aws-vault-darwin-%arch%.dmg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%NAME%</string>
				<key>requirement</key>
				<string>identifier "aws-vault" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = NRM9HVJ62Z</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
