<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest aws-vault from GitHub</string>
	<key>Identifier</key>
	<string>com.github.autopkg.install.aws-vault</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>aws-vault</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.arubdesu-recipes.aws-vault.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>items_to_copy</key>
				<array>
					<dict>
						<key>source_item</key>
						<string>aws-vault</string>
						<key>destination_path</key>
						<string>/usr/local/bin/</string>
					</dict>
				</array>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
		</dict>
	</array>
</dict>
</plist>
