<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of LingonX.</string>
	<key>Identifier</key>
	<string>com.github.arubdesu.download.LingonX</string>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LingonX</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://www.peterborgapps.com/updates/lingonx5-appcast.xml</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe is no longer maintained and will be removed soon, please use the much better versions found at github.com/autopkg/macprince-recipes</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
