<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Finds latest Lync installer, downloads the disk image and extracts the pkg.
Set VERSION to a specific version number to download that version instead.
Set CULTURE_CODE to a different value to get a different localization. See
http://msdn.microsoft.com/en-us/library/ee825488(v=cs.20).aspx for a table of Culture Codes.</string>
    <key>Identifier</key>
    <string>com.github.arubdesu.munki.LyncInstaller</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MSLync</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Office2011</string>
        <key>VERSION</key>
        <string>latest</string>
        <key>CULTURE_CODE</key>
        <string>0409</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
              <string>MSN Messenger</string>
              <string>Microsoft Lync</string>
              <string>Microsoft Error Reporting</string>
              <string>Microsoft Communicator</string>
              <string>Microsoft Messenger</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is no longer maintained</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
